from unicodedata import name
from flask import Flask, render_template, url_for, redirect, request, flash
from multiprocessing import context
import pandas as pd
from docxtpl import DocxTemplate


app = Flask(__name__)
app.config['DEBUG'] = True


@app.route('/', methods=['GET', 'POST'])
def index():
    months = ["січня", "лютого", "березня", "квітня", "травня", "червня",
              "липня", "серпня", "вересня", "жовтня", "листопада", "грудня"]
    days = ["перше", "друге", "третє", "четверте",
            "п'яте", "шосте", "сьоме", "восьме", "дев'яте", "десяте", "одинадцяте", "дванадцяте", "тринадцяте", "чотирнадцяте", "п'ятнадцяте", "шістнадцяте", "вісімнадцяте", "дев'ятнадцяте", "двадцяте", "двадцять перше", "двадцять друге", "двадцять третє", "двадцять четверте", "двадцять п'яте", "двадцять шосте", "двадцять сьоме", "двадцять восьме", "двадцять дев'яте", "тридцяте", "тридцять перше"]
    years = ["двадцять другого", "двадцять третього", "двадцять четвертого", "двадцять п'ятого", "двадцять шостого", "двадцять сьомого", "двадцять восьмого", "двадцять дев'ятого", "тридцятого", "тридцять першого", "тридцять другого", "тридцять третього", "тридцять четвертого", "тридцять п'ятого", "тридцять шостого", "тридцять сьомого", "тридцять восьмого", "тридцять дев'ятого", "сорокового", "сорок першого", "сорок другого", "сорок третього", "сорок четвертого", "сорок п'ятого", "сорок шостого", "сорок сьомого", "сорок восьмого", "сорок дев'ятого", "п'ятдесятого", "п'ятдесят першого", "п'ятдесят другого", "п'ятдесят третього", "п'ятдесят четвертого", "п'ятдесят п'ятого", "п'ятдесят шостого", "п'ятдесят сьомого", "п'ятдесят восьмого", "п'ятдесят дев'ятого", "шістдесятого", "шістдесят першого", "шістдесят другого",
             "шістдесят третього", "шістдесят четвертого", "шістдесят п'ятого", "шістдесят шостого", "шістдесят сьомого", "шістдесят восьмого", "шістдесят дев'ятого", "сімдесятого", "сімдесят першого", "сімдесят другого", "сімдесят третього", "сімдесят четвертого", "сімдесят п'ятого", "сімдесят шостого", "сімдесят сьомого", "сімдесят восьмого", "сімдесят дев'ятого", "вісімдесятого", "вісімдесят першого", "вісімдесят другого", "вісімдесят третього", "вісімдесят четвертого", "вісімдесят п'ятого", "вісімдесят шостого", "вісімдесят сьомого", "вісімдесят восьмого", "вісімдесят дев'ятого", "дев'яностого", "дев'ятдесят першого", "дев'ятдесят другого", "дев'ятдесят третього", "дев'ятдесят четвертого", "дев'ятдесят п'ятого", "дев'ятдесят шостого", "дев'ятдесят сьомого", "дев'ятдесят восьмого", "дев'ятдесят дев'ятого"]
    smallNumbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
    if request.method == 'POST':
        content = request.form.to_dict(flat=True)
        print(content["file"]+".docx")
        if content == None:
            flash('No info provided')
            return redirect(url_for('index'))
        tpl = DocxTemplate(content["file"]+".docx")
        tpl.render(content)
        tpl.save("done/%s%s.docx" % (content["file"], content["surname_N1"]))
        return render_template('final.html', content=content)
    return render_template('index.html', months=months, days=days, years=years, smallNumbers=smallNumbers)
